# Reading Data

* Python has a large number of different ways to read data from external files. 
* Python supports almost any type of file you can think of, from simple text files to complex binary formats.
* In this class we are going to mainly use the pakage **`pandas`** to load external files into `DataFrames`.

In [1]:
import pandas as pd
import numpy as np

##### Let us read-in the file: `./Data/Planets.csv`

```
Name,a,
Mercury,0.3871,0.2056
Earth,0.9991,0.0166
Jupiter,5.2016,0.0490
Neptune,29.9769,0.0088
```

In [2]:
planet_table = pd.read_csv('./Data/Planets.csv')

In [3]:
planet_table

      Name        a  Unnamed: 2
0  Mercury   0.3871      0.2056
1    Earth   0.9991      0.0166
2  Jupiter   5.2016      0.0490
3  Neptune  29.9769      0.0088

## Renaming columns

In [4]:
planet_table.rename(columns={'Unnamed: 2': 'ecc'}, inplace=True)

planet_table

      Name        a     ecc
0  Mercury   0.3871  0.2056
1    Earth   0.9991  0.0166
2  Jupiter   5.2016  0.0490
3  Neptune  29.9769  0.0088

In [5]:
planet_table.loc[:, 'ecc']

0    0.2056
1    0.0166
2    0.0490
3    0.0088
Name: ecc, dtype: float64

In [6]:
planet_table['ecc']

0    0.2056
1    0.0166
2    0.0490
3    0.0088
Name: ecc, dtype: float64

### Sometimes you want just the data without the index (`.values`)

In [7]:
my_values = planet_table['ecc'].values

my_values

array([0.2056, 0.0166, 0.049 , 0.0088])

In [8]:
my_values[0:2]

array([0.2056, 0.0166])

## Adding a column - `insert`

`.insert(loc, column, value, allow_duplicates = False)`

#### perihelion distance [AU] = `semi_major axis * ( 1 - eccentricity )`

In [9]:
def find_perihelion(semi_major, eccentricity):
    result = semi_major * (1.0 - eccentricity)
    return result

#### Use `DataFrame` columns as arguments to the `find_perihelion` function

In [10]:
my_perihelion = find_perihelion(planet_table['a'], planet_table['ecc'])

In [11]:
my_perihelion

0     0.307512
1     0.982515
2     4.946722
3    29.713103
dtype: float64

In [12]:
# Add column in position 1 (2nd column)

planet_table.insert(1, 'Perihelion', my_perihelion, allow_duplicates = False)

In [13]:
planet_table

      Name  Perihelion        a     ecc
0  Mercury    0.307512   0.3871  0.2056
1    Earth    0.982515   0.9991  0.0166
2  Jupiter    4.946722   5.2016  0.0490
3  Neptune   29.713103  29.9769  0.0088

## Removing a column - `drop`

In [14]:
planet_table.drop(columns='Perihelion', inplace = True)

In [15]:
planet_table

      Name        a     ecc
0  Mercury   0.3871  0.2056
1    Earth   0.9991  0.0166
2  Jupiter   5.2016  0.0490
3  Neptune  29.9769  0.0088

## Adding a column (quick) - always to the end of the table

In [16]:
planet_table['Perihelion'] = my_perihelion

In [17]:
planet_table

      Name        a     ecc  Perihelion
0  Mercury   0.3871  0.2056    0.307512
1    Earth   0.9991  0.0166    0.982515
2  Jupiter   5.2016  0.0490    4.946722
3  Neptune  29.9769  0.0088   29.713103

## Rearranging columns

In [18]:
planet_table.columns

Index(['Name', 'a', 'ecc', 'Perihelion'], dtype='object')

In [19]:
my_new_order = ['a', 'Perihelion', 'Name', 'ecc']

In [20]:
planet_table = planet_table[my_new_order]

In [21]:
planet_table

         a  Perihelion     Name     ecc
0   0.3871    0.307512  Mercury  0.2056
1   0.9991    0.982515    Earth  0.0166
2   5.2016    4.946722  Jupiter  0.0490
3  29.9769   29.713103  Neptune  0.0088

## Adding a row `.append`

* The new row has to be a `dictionary` or another `DataFrame`
* Almost always need to use: `ignore_index=True`

In [22]:
my_new_row = {'Name': 'Venus', 'a': 0.723, 'ecc': 0.007}

In [23]:
my_new_row

{'Name': 'Venus', 'a': 0.723, 'ecc': 0.007}

In [24]:
planet_table.append(my_new_row, ignore_index=True)

         a  Perihelion     Name     ecc
0   0.3871    0.307512  Mercury  0.2056
1   0.9991    0.982515    Earth  0.0166
2   5.2016    4.946722  Jupiter  0.0490
3  29.9769   29.713103  Neptune  0.0088
4   0.7230         NaN    Venus  0.0070

In [25]:
planet_table

         a  Perihelion     Name     ecc
0   0.3871    0.307512  Mercury  0.2056
1   0.9991    0.982515    Earth  0.0166
2   5.2016    4.946722  Jupiter  0.0490
3  29.9769   29.713103  Neptune  0.0088

In [26]:
planet_table = planet_table.append(my_new_row, ignore_index=True)

In [27]:
planet_table

         a  Perihelion     Name     ecc
0   0.3871    0.307512  Mercury  0.2056
1   0.9991    0.982515    Earth  0.0166
2   5.2016    4.946722  Jupiter  0.0490
3  29.9769   29.713103  Neptune  0.0088
4   0.7230         NaN    Venus  0.0070

#### `NaN` = Not_A_Number, python's null value

----

# Reading (bad) Data

## Different Delimiters

Because some people just want to watch the world burn, they create datasets where the columns are separted by something other than a comma.

#### Bad - Using another delimiter like `:`

##### `./Data/Planets_Ver2.txt`

```
Name:a:
Mercury:0.3871:0.2056
Earth:0.9991:0.0166
Jupiter:5.2016:0.0490
Neptune:29.9769:0.0088
```

In [28]:
planet_table_2 = pd.read_csv('./Data/Planets_Ver2.txt', delimiter = ":")

In [29]:
planet_table_2

      Name        a  Unnamed: 2
0  Mercury   0.3871      0.2056
1    Earth   0.9991      0.0166
2  Jupiter   5.2016      0.0490
3  Neptune  29.9769      0.0088

#### Worse - Using whitespace as a delimiter

##### `./Data/Planets_Ver3.txt`

```
Name a 
Mercury 0.3871 0.2056
Earth 0.9991 0.0166
Jupiter 5.2016 0.0490
Neptune 29.9769 0.0088
```

In [30]:
planet_table_3 = pd.read_csv('./Data/Planets_Ver3.txt', delimiter = " ")

In [31]:
planet_table_3

      Name        a  Unnamed: 2
0  Mercury   0.3871      0.2056
1    Earth   0.9991      0.0166
2  Jupiter   5.2016      0.0490
3  Neptune  29.9769      0.0088

#### WORST! - Using inconsistent whitespace as a delimiter!

##### `./Data/Planets_Ver4.txt`

```
 Name   a 
    Mercury 0.3871  0.2056
 Earth 0.9991   0.0166
     Jupiter 5.2016  0.0490
 Neptune    29.9769    0.0088
```

In [ ]:
planet_table_4 = pd.read_csv('./Data/Planets_Ver4.txt', delimiter = " ", skipinitialspace=True)

In [ ]:
planet_table_4

---

# Messy Data

* `pandas` is a good choice when working with messy data files.
* In the "real world" all data is messy.

##### Let us read-in the file: `./Data/Mess.csv`

```
#######################################################
#
# Col 1 - Name
# Col 2 - Size (km)
#
#######################################################
"Sample 1",10
"",23
,
"Another Sample",
```

### This is not going to end well ... (errors galore!)

In [2]:
messy_table = pd.read_csv('./Data/Mess.csv')

ParserError: Error tokenizing data. C error: Expected 1 fields in line 7, saw 2

### Tell `pandas` about the comments:

In [3]:
messy_table = pd.read_csv('./Data/Mess.csv', comment = "#")

messy_table

         Sample 1    10
0             NaN  23.0
1             NaN   NaN
2  Another Sample   NaN

## Not quite correct ...

### Turn off the header

In [4]:
messy_table = pd.read_csv('./Data/Mess.csv', comment = "#", header= None)

messy_table

                0     1
0        Sample 1  10.0
1             NaN  23.0
2             NaN   NaN
3  Another Sample   NaN

### Add the column names

In [5]:
my_column_name = ['Name', 'Size']

messy_table = pd.read_csv('./Data/Mess.csv', comment = "#", header= None, names = my_column_name)

messy_table

             Name  Size
0        Sample 1  10.0
1             NaN  23.0
2             NaN   NaN
3  Another Sample   NaN

### Deal with the missing data with `.fillna()`

In [7]:
messy_table['Name'].fillna("unknown", inplace=True)
messy_table['Size'].fillna(999.0, inplace=True)

messy_table

             Name   Size
0        Sample 1   10.0
1         unknown   23.0
2         unknown  999.0
3  Another Sample  999.0

----

# Lots of Data

* 'pandas' will cutoff the display of really long tables
* You can change this with `pd.set_option('display.max_rows', # of rows)`

In [8]:
star_table = pd.read_csv('./Data/NamedStars.csv')

In [9]:
star_table

         Name         RA        DEC
0   Alpheratz   0.139769  29.090828
1        Caph   0.152803  59.150218
2     Algenib   0.220597  15.183616
3       Ankaa   0.438019 -42.305122
4      Shedir   0.675108  56.537409
..        ...        ...        ...
65       Enif  21.736428   9.875008
66     Alnair  22.137188 -46.960616
67  Fomalhaut  22.960785 -29.621837
68     Scheat  23.062870  28.082455
69     Markab  23.079338  15.205368

[70 rows x 3 columns]

In [10]:
pd.set_option('display.max_rows', 70)

In [11]:
star_table

               Name         RA        DEC
0         Alpheratz   0.139769  29.090828
1              Caph   0.152803  59.150218
2           Algenib   0.220597  15.183616
3             Ankaa   0.438019 -42.305122
4            Shedir   0.675108  56.537409
5            Diphda   0.726452 -17.986684
6            Mirach   1.162166  35.620830
7          Achernar   1.628542 -57.236660
8             Hamal   2.119524  23.462777
9           Polaris   2.529743  89.264138
10           Menkar   3.037994   4.089925
11            Algol   3.136147  40.955651
12          Mirphak   3.405375  49.861243
13          Alcyone   3.791407  24.105242
14        Aldebaran   4.598667  16.509762
15            Rigel   5.242298  -8.201639
16          Capella   5.278138  45.999029
17        Bellatrix   5.418852   6.349735
18           Alnath   5.438194  28.607873
19            Nihal   5.470757 -20.759232
20            Arneb   5.545504 -17.822292
21          Alnilam   5.603559  -1.201917
22          Alnitak   5.679312  -1.942578
23            Saiph   5.795941  -9.669602
24       Betelgeuse   5.919525   7.407036
25          Canopus   6.399192 -52.695718
26           Alhena   6.628528  16.399415
27           Sirius   6.752569 -16.713143
28           Adhara   6.977096 -28.972089
29           Castor   7.576668  31.888636
30          Procyon   7.655149   5.227508
31           Pollux   7.755379  28.026310
32          Alphard   9.459792  -8.658683
33          Regulus  10.139572  11.967195
34          Algieba  10.332823  19.841860
35            Merak  11.030664  56.382345
36            Dubhe  11.062177  61.751119
37         Denebola  11.817744  14.572337
38             Phad  11.897150  53.694733
39            Acrux  12.443317 -63.099056
40           Alioth  12.900454  55.959843
41     Vindemiatrix  13.036322  10.959102
42            Mizar  13.398728  54.925415
43            Spica  13.419890 -11.161245
44           Alkaid  13.792374  49.313303
45            Hadar  14.063735 -60.372978
46         Arcturus  14.261208  19.187270
47  RigelKentaurusB  14.660942 -60.839471
48  RigelKentaurusA  14.661361 -60.835147
49             Izar  14.749792  27.074174
50           Kochab  14.845110  74.155476
51         Alphekka  15.578108  26.714910
52        Unukalhai  15.737777   6.425520
53          Antares  16.490130 -26.431946
54       Rasalgethi  17.244128  14.390253
55           Shaula  17.560146 -37.103748
56       Rasalhague  17.582224  12.560576
57           Etamin  17.943438  51.488951
58    KausAustralis  18.402874 -34.384315
59             Vega  18.615607  38.782993
60            Nunki  18.921088 -26.296594
61          Tarazed  19.770992  10.613269
62           Altair  19.846301   8.867385
63            Deneb  20.690532  45.280334
64        Alderamin  21.309606  62.585455
65             Enif  21.736428   9.875008
66           Alnair  22.137188 -46.960616
67        Fomalhaut  22.960785 -29.621837
68           Scheat  23.062870  28.082455
69           Markab  23.079338  15.205368